/* 7. Имеется функция squareList. Вам необходимо завершить код для нее, используя любую комбинацию
 функций высшего порядка map(), filter() и reduce(), 
 чтобы она возвращала новый массив, содержащий только квадрат только положительных целых чисел 
 (десятичные числа не являются целыми числами).
Примером массива, содержащего только действительные числа, является [-3, 3, 8, 8.2, 4.8, 5, 3, -3.2].
Примечание. Ваша функция не должна использовать циклы for или while или функцию forEach ().
const squareList = (arr) => {
  // править код ниже
 return arr;
  // изменять код до этой строки
};

// проверка
const squaredIntegers = squareList([-3, 3, 8, 8.2, 4.8, 5, 3, -3.2]);
console.log(squaredIntegers); // [9, 64, 25, 9]
*/

const squareList = arr => {
  arr = arr.filter(arr => arr > 0 && arr % 1 === 0);
  arr = arr.map(n => {
    return n * n;
  });
  return arr;
  // изменять код до этой строки
};
const squaredIntegers = squareList([-3, 3, 8, 8.2, 4.8, 5, 3, -3.2]);
console.log(`${squaredIntegers}`); // [9, 64, 25, 9]
